publish/career/resume.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-26 Sun 13:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Resume</title>
<meta name="author" content="ahnaf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/css/resume.css" />
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Open+Sans">
</head>
<body>
<div id="content" class="content">

<div id="outline-container-resume-head" class="outline-2">
<h2 id="resume-head">AHNAF SIDDIQI | <span id="contact"><span>email: ahnafsidd@gmail.com</span><span id="phone"><span>phone:  +65 97342978</span></h2>
<div class="outline-text-2" id="text-resume-head">
<p>
An engineer keen in cloud, network security, high traffic systems, and
system design with 6+ years of experience. I love building secure products
with high availability. I am also interested to learn about Network Science
</p>
</div>

<div id="outline-container-org68eefb8" class="outline-3">
<h3 id="org68eefb8"><span>Tools</span></h3>
<div class="outline-text-3" id="text-org68eefb8">
<p>
Experienced in: Python, C, Go, Docker, Git, Linux, Make, Nginx, PostgreSQL,
MySQL, InfluxDB, Bash, X509 Certs, TCP/UDP, TLS, Gitlab, CI/CD, Flask,
SQLAlchemy, HTTP(S), SNMP, MQTT, AWS, Kafka, ES, Kibana, Kubernetes
</p>

<p>
Familiar with: JS, HTML, CSS, GDB, Puppet, Redis, Grafana, CPP, MongoDB,
DTLS, Ansible
</p>
</div>
</div>
<div id="outline-container-org02e2cc0" class="outline-3">
<h3 id="org02e2cc0"><span>Education</span></h3>
<div class="outline-text-3" id="text-org02e2cc0">
</div>
<div id="outline-container-orgadee7bd" class="outline-4">
<h4 id="orgadee7bd">Singapore University of Technology and Design <span>Class of 2016</span></h4>
<div class="outline-text-4" id="text-orgadee7bd">
<p>
Bachelor of Engineering with Honors majoring in Information Systems
Technology and Design. <br>
Specialization: Security and Communications, Artificial Intelligence.
</p>
</div>
</div>
</div>

<div id="outline-container-org5352e10" class="outline-3">
<h3 id="org5352e10"><span>Work Experience</span></h3>
<div class="outline-text-3" id="text-org5352e10">
</div>
<div id="outline-container-org1f285c5" class="outline-4">
<h4 id="org1f285c5">Bytedance Pte. Ltd. ~ Site Reliability Engineer (Security) <span>Nov’22 - Now</span></h4>
<div class="outline-text-4" id="text-org1f285c5">
<p>
SRE in charge of 2 direct security products in a team of 25. I also
manage/provision our internal Kubernetes cluster including standard
sysadmin responsibilities
</p>

<ul class="org-ul">
<li>Designed and implemented application metrics which captured errors which
were eventually converted to P0 (user facing alerts), reducing the P0
stats by over 50%</li>
<li>Metrics redesign helped to negotiate a clear SLA with our stakeholders
with a enforced, data backed agreement of 99.9% which established a
Runbook</li>
<li>Correlated cpu, memory information which was piped into metrics with
host data to provided yearly estimates of resources using a simple
linear regression model.</li>
<li>Identified an intermittent race condition by initially using a
flamegraph generated by using a go profiler.</li>
<li>strace and gdb helped to identify a race condition due to futex<sub>wait</sub>
which helped in reducing the resource application and help boost
application perforance.</li>
<li>Stabilized apache Kafka platform which consistenly produces 76 Million
messages/sec. Identified critical bottlenecks and proposed redesign of
the system architecture to handle congestion. The system recovered
without any data loss.</li>
<li>Provisioned Hashicorp/vault in a high availability cluster backed by
Oracle KMS and a secondary vault to perform auto-unseal:
<a href="https://developer.hashicorp.com/vault/docs/configuration/seal/ocikms">https://developer.hashicorp.com/vault/docs/configuration/seal/ocikms</a></li>
<li>Introduced blue-green/canary deployment concepts to infrastructure team
with 0 downtime upgrade of applications.</li>
<li>Reduced the runtime of Apache Flink job processing 20+Tb of data 10+
from 12+ hours to 4.</li>
<li>Managed, reviewed, provisioned host instances, deployed application as
K8s deployment/rollout/statefulset, scraped cluster metrics using
prometheus agent, and collected logs using Loki.</li>
<li>Conducted standard DevOps/Testing practices including regression
testing and torture tests</li>
<li>Actively prompted R&amp;D to use Alpine Linux based images by providing
example-led demonstration by reducing image size which saved in storage costs.</li>
<li>Introduced go-mmproxy which attaches client address infront of the TCP
packet header to preserve ip addresses in Layer 4 of the OSI model</li>
<li>Automated several dry operations which installs, provisions, fix various
adhoc tasks using python, go, and bash.</li>
<li>Regularly particpated in global-oncall with colleagues in 4 different
timezone, while managing internal customer requriements across 4
cultures.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfcc8a9b" class="outline-4">
<h4 id="orgfcc8a9b">MicroSec Pte. Ltd. ~ {DevOps, Software,Operations} Engineer <span>Nov’17 - Oct’22</span></h4>
<div class="outline-text-4" id="text-orgfcc8a9b">
<p>
I created product milestones from stakeholder requirements to application
implementation, lifecycle and deployment, while managing technical
customer operations. I also managed the their DevOps pipeline mainly in
AWS.
</p>

<p>
<i>Role - DevOps Engineer</i>
</p>

<ul class="org-ul">
<li>Managed companies on-premise Gitlab, scheduling regular upgrades and
performing regular maintenance</li>
<li>Led the deployment of 3 main products and designed the development
workflow using Gitlab's runner.</li>
<li>Developed a local product deployment script using bash which the
developers used to simulate a full product deployment. The script is
also used to demonstrate repeatable demos to internal stakeholders.</li>
<li>Wrote lightweight Docker images using multi-stage build that uses alpine
to significantly reduce image size.</li>
<li>Developed companies Software Release Management strategies working
within the Scrum methodology.</li>
<li>Configured AWS IAM roles following least privlege principle for users and
application system.</li>
<li>Configured AWS VPC, Security Groups, Route53, ECR, EC2 and several
others which is required to provision an entire deployment suites.</li>
<li>Deployed and managed a production systems of 16K end-devices in a Docker
Swarm for AWS</li>
</ul>

<p>
<i>Role - Software Engineer</i>
</p>

<ul class="org-ul">
<li>Responsible for requirement gathering, analysis and translation into
well-defined work description for developers to design and implement.</li>
<li>Developed MicroPKI: a performant multithreaded socket server, that
implements a proprietary TLS 1.3 for embedded devices in IoT strictly
uses ECC Keys, specifically Ed25519</li>
<li>Certificates are fine-tuned for embedded devices, with its inhouse
implementation of CRL and OCSP responder</li>
<li>Wrote MicroPKI protocol in C, which loads as a static library in
frontend wrapper APIS including: HTTP and MQTT</li>
<li>Maintained an Energy Monitoring product that uses Modbus to read
localized data that is transferred near real-time via MQTT that is
batched process and stored in InfluxDB.</li>
<li>Led the design and implementation of RESTful microservices using python
that supports in-house implementations of ACMEv2, EST, and SCEP
following their respective RFCs: 8555, 7030, 8894.</li>
<li>Introduced the automation of backend e2e testing with unit test at
microservices level and integration test at a separate product level.</li>
<li>Implement simulation testbeds that replicates a CANBUS protocol scenario
using Docker.</li>
<li>Identified a missing parser in Microsofts Library for SCEP protocol
after parsing the ASN.1 certificate data structure.</li>
</ul>

<p>
<i>Role - Operations</i>
</p>

<ul class="org-ul">
<li>Led Scrum Master duties for two teams of 10+ individuals.</li>
<li>Evangelize the Scrum philosophy with the development team to promote
code reviews and collaboration.</li>
<li>Increased team delivery yield by a factor of 1.5, rotating or setting
expectations after various 1-1 meetings.</li>
<li>Negotiated product deliverable timeline per sprint between different
internal stakeholders and external clients</li>
<li>Mentored several interns to full time employees following companies
guidelines.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5f2f366" class="outline-3">
<h3 id="org5f2f366"><span>Publications</span></h3>
<div class="outline-text-3" id="text-org5f2f366">
<p>
<b><b>Patent</b></b>: MicroSec's patent for securing communications in Embedded
Systems that uses a proprietary PKI based protocol
</p>

<p>
<p id="indent">Vishram Mishra, A. Siddiqi et al (2022). Method and Architecture for Securing and Managing Networks of Embedded Systems with Optimised Public Key Infrastructure (20220006652-A1). U.S. Patent and Trademark Office. Pending</p>
</p>

<p>
<b><b>Paper</b></b>: Detailed network segment, protocol, and service analysis of
EPIC Industrial testbed
</p>

<p>
<p id="indent">A. Siddiqi, N. O. Tippenhauer, D. Mashima, and B. Chen, “On practical threat scenario testing in an electric power ics testbed,” in Proceedings of the cyber-physical system security workshop (cpss), co-located with asiaccs, 2018. https://doi.org/10.1145/3198458.3198461</p>
</p>
</div>
</div>

<div id="outline-container-org45bbb18" class="outline-3">
<h3 id="org45bbb18"><span>Certifications</span></h3>
<div class="outline-text-3" id="text-org45bbb18">
<p>
Certified DevSecOps Professional (CDP) - May 2022 
</p>
<ul class="org-ul">
<li>Issuer: Practical DevSecOps</li>
<li><a href="https://www.credly.com/badges/050092ca-2a33-4abc-bacd-287462b27e58">Badge Link</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
